app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My post title"], ["description", "My post description"], ["created_at", "2017-02-28 23:02:21.884639"], ["updated_at", "2017-02-28 23:02:21.884639"]]
---
  def create
    Post.create(title: params[:post][:title], description: params[:post][:description])